# Условный оператор
Ссылка: https://goo-gl.su/RrlAASQ


## Теория
Пример
``` C++
#include <iostream>


using namespace std;


int main() {
  if (true) {
    cout << "True" << endl;
  } else {
    cout << "False" << endl;
  }
}
```

Ветка `else` не является обязательной
``` C++
#include <iostream>


using namespace std;


int main() {
  if (true) {
    cout << "True" << endl;
  }
}
```

Можно использовать выражения
``` C++
#include <iostream>


using namespace std;


int main() {
  int a, b, c;
  cin >> a >> b >> c;
  if (a == b && b == c) {
    cout << "==" << endl;
  } else {
    cout << "!=" << endl;
  }
}

```

Можно комбинировать несколько условий подряд

``` C++
#include <iostream>


using namespace std;


int main() {
  int n;
  cin >> n;
  if (n == 0) {
    cout << "Zero" << endl;
  } else if (n == 1) {
    cout << "One" << endl;
  } else if (n == 2) {
    cout << "Two" << endl;
  } else if (n == 3) {
    cout << "Three" << endl;
  } else {
    cout << "?" << endl;
  }
}
```


## Примеры
Дано целое число. Выведите его модуль.
``` C++
#include <iostream>

using namespace std;

int main() {
  // Объявляем целочисленные переменные x и abs_x. В переменной abs_x будем хранить модуль значения переменной x.
  int x, abs_x;

  // Вводим значение переменной x с клавиатуры.
  cin >> x;

  if (x >= 0) {
    // В случае если значение переменной x больше либо равно нулю, то модуль это и есть значение переменной x.
    abs_x = x;
  } else {
    // В случае если значение переменной x меньше нуля, то модуль это значение переменной x со знаком минус.
    abs_x = -x;
  }


  cout << "|" << x << "| = " << abs_x << endl;
}
```

Даны два целых числа. Выведите значение наибольшего и наименьшего из них.
``` C++
#include <iostream>

using namespace std;

int main() {
  // Объявляем целочисленные переменные: a, b, min_value, max_value. В переменной min_value будем хранить минимальное значение среди значений переменных a и b, а в max_value - максимальное.
  int a, b, min_value, max_value;

  // Вводим значения перменных a и b с клавиатуры.
  cin >> a >> b;

  // Присваиваем переменной min_value минимальное значение среди значений переменных а и b, а max_value - максимальное.
  if (a < b) {
    // Случай, когда значение переменной a меньше значения переменной b.
    min_value = a;
    max_value = b;
  } else {
    // Тут значение переменной a не больше значения переменной b.
    min_value = b;
    max_value = a;
  }

  // Выводим значения переменных min и max.
  cout << "Min: " << min_value << endl;
  cout << "Max: " << max_value << endl;
}
```


## Задачи
 * Дано целое число t - температура в помещении в градусах цельсия. Выведите строку `Fire situation`, если температура в помещении выше 60 градусов по цельсию.
 * Кодовый замок открывается, если нажать последовательно кнопки 1, 0, 8, 4. Напишите программу, моделирующую поведение этого замка. Выведите строку `Open`, если введен верный код, иначе `Close`. Примеры: `1084 - Open`, `6427 - Close`.
 * Даны целые числа a и b - числитель и знаменатель дроби соответственно. Выведите `Yes`, если данная дробь является правильной, иначе `No`. Дробь называется правильной, если ее числитель меньше знаменателя.
 * Дано целое число n. Выведите его знак, т.е. если число n больше нуля, то вывести `+`, если меньше, то `-`, если равно, то `0`.
 * Даны два целых числа a и b. Выведите `Yes`, если a делится на b нацело, иначе `No`.
 * Услуги телефонной связи оплачиваются по следующему правилу: за разговоры до 500 минут (включительно) в месяц - 350 рублей, за разговоры сверх установленной нормы оплачиваются из расчета 2 рубля за минуту. Дано целое число t - суммарное количество минут разговоров за прошедший месяц. Выведите размер платы в рублях за даннй период. 
 * Дано целое число. Если оно четное, то выведите `Even`, иначе `Odd`.
 * Дано целоe число. Выведите следующее за ним **четное** число.
 * Даны три целых числа. Выведите количество положительных среди них.
 * Даны два целых числа x и y - координаты точки. Выведите номер координатной четверти, к которой принадлежит точка.
 * Даны две точки на плоскости с целочисленными координатами x1, y1 и x2, y2 соответсвенно. Выведите номер точки (`1` или `2`), которая ближе к началу координат.
 * Дано целое число - номер месяца. Выведите количество дней в этом месяце. Примечание: Количество дней в феврале будем считать равным 29. Примеры: `1 - 31`, `2 - 29`, `3 - 31`.
 * Дано целое число - номер месяца. Выведите название времени года (`Winter`, `Spring`, `Summer`, `Autumn`) в этом месяце. Пример: `1 - Winter`.
 * Дано целое число - номер года. Если год является высокосным, то выведите `Yes` иначе `No`. Год является високосным, если его номер кратен 4, но не кратен 100, а также если он кратен 400. Примеры: `2012` - `Yes`, `2011` - `No`, `1492` - `Yes`, `1861` - `No`, `1600` - `Yes`, `1700` - `No`, `1800` - `No`, `1900` - `No`, `2000` - `Yes`.
 * Даны три целых числа. Выведите значение наибольшего из них.
 * Даны три целых числа - длины сторон треугольника. Выведите `Yes`, если такой треугольник существует, иначе `No`. Треугольник существует, если длина любой стороны меньше суммы длин двух оставшихся.
 * Кодовый замок открывается, если нажать кнопки 1, 2, 8 в любом порядке. Напишите программу, моделирующую поведение этого замка. Выведите строку `Open`, если введен верный код, иначе `Close`. Примеры: `128 - Open`, `218 - Open`, `821 - Open`, `642 - Close`.
 * Даны три целых числа. Выведите количество совпадающих чисел. Примеры: `1 1 1` - `3`, `1 1 2` - `2`, `1 2 3` - `0`.
 * Дана шоколадка, имеющая вид прямоугольника, разделенного на n × m долек. Шоколадку можно один раз разломить по прямой на две части. Выведите `Yes`, если таким образом можно отломить от шоколадки ровно k долек, иначе `No`. 
 * Дано целое трехзначное число. Выведите `Yes`, если его цифры образуют возрастающую последовательность, иначе `No`. Примеры: `123 - Yes`, `121 - No`, `112 - No`.
 * Дано целое четырехзначное число. Выведите `Yes`, если оно является палиндромом, иначе `No`. Число является палиднромом, если оно читается одинаково как справа налево, так и слева направо. 
 * Дано целое число - номер автобусного билета. Если билет является счастливым, то выведите `Happy`, иначе `Ordinary`.
 * Дано три целых числа. Выведите все три числа в порядке неубывания.
 * Даны две коробки со сторонами a1, b1, c1 и a2, b2, c2 соответственно. Выведите `Yes`, если одну коробку можно разместить внутри другой, иначе `No`.
 * Даны три числа - стороны треугольника. Выведите тип этого треугольника (Остроугольный - `Acute`, Прямоугольный - `Right`, Тупоугольный - `Obtuse`).


## Полезные ссылки
 * [ACMP - Условный оператор](https://acmp.ru/asp/do/index.asp?main=section&id_course=1&id_section=2)
